Tekla Open API Reference for Tekla Structures 2025
BoltGroup.BoltHoleTypeEnum Enumeration
 The special hole type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum BoltHoleTypeEnum
Public Enumeration BoltHoleTypeEnum
Members
Member name | Value | Description
HOLE_TYPE_OVERSIZED | 0 |  The oversized hole type.
HOLE_TYPE_SLOTTED | 1 |  The slotted hole type.
HOLE_TYPE_NO_HOLE | 2 |  The no hole type.
HOLE_TYPE_TAPPED | 3 |  The tapped hole type.
See Also
Reference
Tekla.Structures.Model Namespace